CSI API ETABS v1
cStory.GetSimilarTo Method
 Retrieves whether a story is a master story, and if not, which master story it is similar to
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSimilarTo(
	string Name,
	ref bool IsMasterStory,
	ref string SimilarToStory
)
Function GetSimilarTo (
	Name As String,
	ByRef IsMasterStory As Boolean,
	ByRef SimilarToStory As String
) As Integer
Dim instance As cStory
Dim Name As String
Dim IsMasterStory As Boolean
Dim SimilarToStory As String
Dim returnValue As Integer
returnValue = instance.GetSimilarTo(Name,
	IsMasterStory, SimilarToStory)
int GetSimilarTo(
	String^ Name,
	bool% IsMasterStory,
	String^% SimilarToStory
)
abstract GetSimilarTo :
        Name : string *
        IsMasterStory : bool byref *
        SimilarToStory : string byref -> int
Parameters
Name
Type: System.String
 The name of a defined story
IsMasterStory
Type: System.Boolean
True if the story is a master story, False otherwise
SimilarToStory
Type: System.String
 If IsMasterStory is False then this is the master story that the requested story is similar to.
Return Value
Type: Int32
 Returns zero if the value is successfully retrieved, otherwise returns nonzero.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim MasterStory As Boolean
       Dim SimilarToStory As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'get story similar data
       ret = SapModel.Story.GetSimilarTo("Story2", MasterStory, SimilarToStory)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cStory Interface
ETABSv1 Namespace